
// 订单类型
export const orderTypeMap = {
  1: "购买",
  2: "出售",
};

// 订单状态
// 状态 0订单完成 1申诉中 2 购买时-待付款 出售时-待收款 3 收款待确认 4超时 5交易取消 6申诉处理中 7申诉成功（收款成功） 8申诉失败（收款失败）9驳回
export const orderStatusMap = {
  0: "订单完成",
  1: "申诉中",
  2: "待付款",
  3: "收款待确认",
  4: "订单超时",
  5: "交易取消",
  6: "申诉处理中",
  7: "申诉成功",
  8: "申诉失败",
  9: "驳回",
};
export const orderStatusMap2 = {
  1: "待付款",
  2: "待收款",
}
export const orderStatusColorMap = {
  0: "#449367",
  1: "#3EABC2",
  2: "#232425",
  3: "#232425",
  4: "#D41919",
  5: "#E15E5E",
  6: "#232323",
  7: "#1587FF",
  8: "#D41919",
  9: "#5F19D4",
};
// 各个状态下的提示文案
/*
申诉中-订单正在申诉中请您耐心等待
待付款—倒计时-订单正在付款中请您耐心等待
收款待确认-订单已付款请确认
订单超时-订单已超时请重新发起订单
交易取消-交易已取消
申诉处理中-订单正在申诉中请您耐心等待
申诉成功—收款失败-系统已重新开始为您处理订单
申诉失败—收款成功-根据提供的申诉资料判定您已收款成功
驳回-您的申诉已被驳回
*/
export const orderStatusTipMap = {
  0: "您已成功", // 您已成功 购买|出售 20 USDT
  1: "订单正在申诉中请您耐心等待",
  2: "订单正在付款中请您耐心等待", // 前边有倒计时
  3: "订单已付款请确认",
  4: "订单已超时请重新发起订单",
  5: "交易已取消",
  6: "订单正在申诉中请您耐心等待",
  7: "根据提供的申诉资料判定您已收款成功",
  8: "系统已重新开始为您处理订单",
  9: "您的申诉已被驳回",
};


